---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalLink
source: html/16d3dcfd-b63c-8496-c261-8946a108e28c.htm
---
# AnalyticalLink Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.